c5/src/InformationRegisters/TaxItems/TaxItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TaxItems</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>Percent</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </resources>
  <dimensions>
    <name>Tax</name>
    <type>
      <types>CatalogRef.TaxItems</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/TaxGroups/TaxGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TaxGroups</name>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/InvoiceFormSrv/Module.bsl
Function GetTaxes ( val TaxGroup, val Date ) export
	
	s = "
	|select Taxes.Tax as Tax, Info.Percent as Percent
	|from Catalog.TaxGroups.Taxes as Taxes
	|	//
	|	// Info
	|	//
	|	left join InformationRegister.TaxItems.SliceLast ( &Date, Tax in ( select distinct Tax from Catalog.TaxGroups.Taxes where Ref = &Ref ) ) as Info
	|	on Info.Tax = Taxes.Tax
	|where Taxes.Ref = &Ref
	|order by Taxes.LineNumber
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", TaxGroup );
	q.SetParameter ( "Date", Date );
	return CollectionsSrv.Serialize ( q.Execute ().Unload () );
	
EndFunction
